Autodesk.Revit.DB.DirectShapeLibrary.AddDefinition(System.String,System.Collections.Generic.IList`1{Autodesk.Revit.DB.GeometryObject})
Add a definition to be reused by instances. A definition is a collection of geometry objects.
id:
ID of the definition to be added. Must be unique.
GNodes:
Definition as a list of Geometry objects
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015